app/controllers/items_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]
---
  def create
    @list = List.find(params[:list_id])