app/controllers/lists_controller.rb

  def show
    @list = List.find(params[:id])
    @items = @list.items.order("created_at DESC")
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  ORDER BY created_at DESC  [["list_id", 2]]

  def create
    @list = List.new(list_params)
    if @list.save
---
INSERT INTO "lists" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Second list"], ["created_at", "2015-03-01 13:12:24.952021"], ["updated_at", "2015-03-01 13:12:24.952021"]]

  def update
    @list = List.find(params[:id])
    if @list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "Hello- updated!!!"], ["updated_at", "2015-03-02 02:23:00.086235"], ["id", 7]]